package com.tarena.yadx.type;

public class TestInt {
/*
 * 1.8种基本类型
 * 整数型:byte,short int long
 *      byte:1字节(8位)储存字节数据（较常用）
 *      short:2字节(16位)兼容性考虑
 *      int:4字节(32位)存储普通的整数(最常用的)
 *      long:8字节(64位)存储长整数(常用)
 * 浮点数型:float double
 * float:4字节(32位)存储单精度浮点数(不用)
 * double:8字节(64位)存储双精度浮点数
 * 字符型:char
 * char:2个字节(16位)存储的是一个字符
 * 布尔型:boolean
 * boolean:1个字节(8位)逻辑变量true或false
 */
	/*
	 * 1.int是常用的整数类型。一个int类型的变量占4个字节(32位)，范围：-2^31~2^31-1
	 * 2.整数的直接量是int类型，所谓整数的直接两就是直接写出来的整数
	 *          注意：-证书的直接量的类型默认为int，如果直接写出的整数超过了int表达范围,就会出现编译错误                                                      
	 *                -除了通常的十进制书写形式，整数直接量也经常写16进制形式(0x或者0X开头)
	 *                 或八进制的形式(0开头)
	 * 3.两个整数相除会舍弃小数部分（不是四舍五入）结果也是整数
	 * 4.整数运算的溢出：两个整数金牛星运算时其结果可能超过整数的范围而溢出                  
	 */
	
	
}
